console.log('Lesson-4 JS');

// Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const modal1 = prompt("Введіть символ");
const modal2 = prompt("Введіть символ");

if (modal1 && modal2) {
  alert("Ви ввели симбол в обох полях, дякую")
  console.log(`Ви ввели симбол в обох полях, дякую`)
} else {
  alert("Ви не ввели символ в одному з полів")
  console.log(`Ви не ввели символ в одному з полів`)
}

// Створити розмітку з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const number1 = Number(prompt("Введить перше число:"));
const number2 = Number(prompt("Введить друге число:"));

if ((number1 + number2) > 10) {
  alert("Число більше 10")
  console.log(`Число більше 10`)
} else {
  alert("Число не більше 10")
  console.log(`Число не більше 10`)
}

// Створити розмітку з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

const javaScript = prompt("Введіть текст:");

if (javaScript.includes("JavaScript")) {
  alert("Текст містить слово JavaScript");
  console.log(`Текст містить слово JavaScript`)
} else {
  alert("Текст не містить слово JavaScript");
  console.log(`Текст не містить слово JavaScript`)
}

// Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".

const tenTwenty = Number(prompt('Введіть число'));

if (tenTwenty > 10 && tenTwenty < 20){
    alert("Число входить в діапазон від 10 до 20")
    console.log(`Число входить в діапазон від 10 до 20`)
} else {
    alert("Число не входить в діапазон від 10 до 20")
    console.log(`Число не входить в діапазон від 10 до 20`)
}

// Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.

const name = prompt("Введіть ім'я:");
const email = prompt("Введіть email:");
const password = prompt("Введіть пароль:");

if (name.length < 3) {
  alert("Ім'я повинно містити не менше 3 символів.");
} 

else if (!email.includes("@") || !email.includes(".", email.indexOf("@"))) {
  alert("Email має містити символ @ та крапку після нього.");
} 

else if (password.length < 6) {
  alert("Пароль має містити не менше 6 символів.");
} 

else {
  alert("Дані введені правильно. Перенаправлення...");
  location.href = "./example.html";
}
