console.log('Lesson-3 JS');
//? Використовуючи два console.log() напиши код, 
//? який виведе в консоль два значення: рядок "" та число
// console.log('It's cold today')
console.log("It's cold today")

console.log('Змінна "20"')

//? --------- ЧИСЛО ---------
    //? 1.Просте виведення значень: 
    //? Якщо потрібно вивести лише значення, 
    //? використовуйте console.log(value).
console.log(20)
// console.log("Число: 20")
const number = 4;
console.log(typeof number)

//? 2.Конкатенація рядків: 
    //? Коли треба об'єднати рядок та значення, 
    //? наприклад: "Сума:" + total
    //? та поєднати все в рядок
console.log("Число: " + 1)


console.log("Число: " + 1 + 2)

console.log("Число: " + '3')

console.log("Число: " + number)

//? 3.Множинні аргументи: 
    //? Коли потрібно вивести кілька об'єктів 
    //? без об'єднання в рядок.
console.log("Число:",  5)

//? 4.Шаблонні рядки: 
    //? Для більш читаного та зручного форматування,
    //? особливо при додаванні кількох змінних.
    //? Поєднує все в рядок!
console.log(`Число: ${6}`);