console.log('Lesson-1 JS');

//? Створити змінну з іменем age і присвоїти їй значення свого віку.
//?  Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const age = 14;
console.log( "i'm,", age, "years old" );



//? Створити змінну з іменем name і присвоїти їй значення свого імені.
//? Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const name = "David";
console.log("My name is -", name);


//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const isStudent = true; 
console.log(isStudent);


//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//? Вивести цей рядок в консоль.

//! Код виконаного завдання
const myString = "Життя - це те, що з тобою відбувається, поки ти плануєш інше.";
console.log(myString);


//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

//! Код виконаного завдання
let myNumber = 42;
myNumber += 10;
console.log(myNumber);


//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const myNull = null;
console.log(myNull);


//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.

//! Код виконаного завдання
const nameDisplayElement = document.getElementById("userNameDisplay");

const userName = prompt("Введіть своє ім'я:");

if (userName) {
  const userConfirmation = confirm("Ви хочете зберегти це ім'я?");
  if (userConfirmation) {
    nameDisplayElement.textContent = `Привіт, ${userName} 🫶!`;
  } else {
    nameDisplayElement.textContent = `А не треба було відміняти імʼя 😒 ${userName}`;
  }
} else {
  nameDisplayElement.textContent = "А треба було вводити імʼя 😤";
}




//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//! Код виконаного завдання
const userConfirmation = confirm("Ти правда бажаеш зайти?");
if (userConfirmation) {
  alert("Точно?");
} else {
  alert("Дію відмінено!");
}


//? Створити скрипт який виводить спливаюче попередження за допомогою alert().
//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

//! Код виконаного завдання
alert("Попереджаю тебе: ця сторінка може бути небеспечною!");
const dangerConfirmation = confirm("Ти впевнений, що хочеш зайти?");
if (dangerConfirmation) {
  alert("Будь обережний ⛔️!");
} else {
  alert("Дію відмінено!");
}