console.log('Lesson-1 JS');

//? Створити змінну з іменем age і присвоїти їй значення свого віку.
//?  Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const age = 14;
console.log( "i'm,", age, "years old" );



//? Створити змінну з іменем name і присвоїти їй значення свого імені.
//? Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const name = "David";
console.log("My name is -", name);


//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const isStudent = true; 
console.log(isStudent);


//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//? Вивести цей рядок в консоль.

//! Код виконаного завдання
const myString = "Зміни — закон життя. І ті, хто дивиться тільки в минуле чи лише на сьогодення, пропустять майбутнє.";
console.log(myString);


//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

//! Код виконаного завдання
let myNumber = 42;
myNumber += 10;
console.log(myNumber);


//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const myNull = null;
console.log(myNull);


//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.

//! Код виконаного завдання
const nameDisplayElement = document.getElementById("userNameDisplay");

const userName = prompt("Напиши своё имя:");

if (userName) {
  const userConfirmation = confirm("Хочешь сохронить это имя?");
  if (userConfirmation) {
    nameDisplayElement.textContent =`Привет, ${userName} ྀིྀ!`;
    nameDisplayElement.classList.add("green");
    alert("Имя сохранено!");
  } else {
    nameDisplayElement.textContent = `Ты не сохранила имя`;
    nameDisplayElement.classList.add("red");
  }
} else {
  nameDisplayElement.textContent = "Ты не написала имя";
  nameDisplayElement.classList.add("red");
  alert("Увидимся!")
} 



//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//! Код виконаного завдання
const userConfirmation = confirm("Точно хочешь зайти?");
if (userConfirmation) {
  alert("Уверена?");
} else {
  alert("Отмена!");
}


//? Створити скрипт який виводить спливаюче попередження за допомогою alert().
//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

//! Код виконаного завдання
alert("Эта страница может быть опасной!");
const dangerConfirmation = confirm("Ты уверена что хочешь зайти?");
if (dangerConfirmation) {
  alert("Будь осторожна ⛔️!");
} else {
  alert("Отмена!");
}