console.log('Lesson-6 JS');

// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

console.log('Перше завдання')
let number1 = 1;                 

while (number1 <= 10) {
  console.log(number1);
  number1 += 1;
}

console.log('-----------------------------')
// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue.

console.log('Друге завдання')

for (let i = 2; i <= 20; i+=1) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(i);
}

console.log('-----------------------------')
// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

console.log('Трете завдання')

for (let i = 1; i <= 10;  i+=1) {
  console.log(`7 × ${i} = ${7 * i}`);
}

console.log('-----------------------------')


// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

console.log('Четверте завдання')
const numbers = [1, 2, 3, 4, 5];
let i = 0;

while (i < numbers.length) {
  console.log(numbers[i]);
  i++;
}

console.log('-----------------------------')

// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

console.log('Пʼяте завдання')
const numbers2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

for (let i = 0; i < numbers2.length;  i+=1) {
  if (numbers2[i] === 7) {
    break;
  }
  console.log(numbers2[i]);
}

console.log('-----------------------------')

// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

console.log('Шосте завдання')

let n = 6;
let i1 = 1;

while (true) {
  if (i1 >= n) {
    break;
  }

  console.log(i1);
  i1+=1;
}

console.log('-----------------------------')

// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
console.log('Сьоме завдання')
let i2 = 1;

while (i2 <= 20) {
  if (i2 % 3 === 0) {
    i2++;
    continue;
  }
  console.log(i2);
  i2+=1;
}
